In [25]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from itertools import groupby

In [26]:
df = pd.read_csv('../data/blogtext.csv')
df.head()

,id,gender,age,topic,sign,date,text
0,2059027,male,15,Student,Leo,"14,May,2004","Info has been found (+/- 100 pages,..."
1,2059027,male,15,Student,Leo,"13,May,2004",These are the team members: Drewe...
2,2059027,male,15,Student,Leo,"12,May,2004",In het kader van kernfusie op aarde...
3,2059027,male,15,Student,Leo,"12,May,2004",testing!!! testing!!!
4,3581210,male,33,InvestmentBanking,Aquarius,"11,June,2004",Thanks to Yahoo!'s Toolbar I can ...

In [27]:
print('Amount of blog posts:',len(df))
authors = df['id'].values
print('Number of authors:',len(set(authors)))

Amount of blog posts: 681284
Number of authors: 19320

In [74]:
top = 100
auth_freqs = sorted([(a, len(list(f))) for a,f in groupby(sorted(authors))],key=lambda tup:tup[1],reverse=True)
top_authors = [t[0] for t in auth_freqs[:top]]
df_top = df[df['id'].map(lambda i: i in top_authors)]
print(len(df_top))

112598

In [75]:
df_top.to_csv('../data/blogtext_t100.csv',index=False)